shakilapr/etrike/mtr-stm32/test/test_mtr_full_suite.cpp
// ═══════════════════════════════════════════════════════════════════════
// 7b. Motor Manager: 0x110 mode command must NOT clear a latched E-stop
//     (Phase A regression guard — ESTOP lives on 0x001 / 0x011 only).
// ═══════════════════════════════════════════════════════════════════════
void test_motor_manager_mode_cmd_does_not_clear_estop() {
    std::printf("[TEST GROUP] Motor Manager: 0x110 mode must not clear ESTOP...\n");
    mtr::RelayController relays;
    mtr::DacController dac;
    mtr::MotorManager mgr(relays, dac);
    mgr.init();
    ASSERT_FALSE(mgr.is_estop_active());

    send_mode(mgr, can::Mode::Manual, 100);
    send_power(mgr, true, 100);
    send_safety(mgr, false, 100);
    can::gen::RtDriveCmd drv{2000, static_cast<uint8_t>(can::Gear::D)};
    can::Frame drv_fr;
    can::gen::encode_rt_drive_cmd(drv, drv_fr);
    mgr.handle_frame(drv_fr, 100);
    mgr.tick(100);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);

    // Latch ESTOP via 0x001 SAFETY_ESTOP (the only valid assert path).
    can::Frame estop_fr;
    estop_fr.id = can::kIdSafetyEstop;
    estop_fr.dlc = 0;
    mgr.handle_frame(estop_fr, 105);
    send_safety(mgr, true, 108);
    ASSERT_TRUE(mgr.is_estop_active());

    // Hammering SYS_MODE_CMD (now MANUAL/AUTO only) must NOT clear the latch.
    for (int i = 0; i < 5; ++i) {
        send_mode(mgr, can::Mode::Auto, 110u + static_cast<uint32_t>(i));
    }
    mgr.tick(120);
    ASSERT_TRUE(mgr.is_estop_active());
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_EQ(dac.current_code(), 0);
}

// ═══════════════════════════════════════════════════════════════════════
// 7c. Motor Manager: asymmetric clear requires TWO consecutive zero 0x011
//     frames — a single zero frame must NOT release the latch.
// ═══════════════════════════════════════════════════════════════════════
void test_motor_manager_asymmetric_clear_requires_two_frames() {
    std::printf("[TEST GROUP] Motor Manager: asymmetric 2-frame clear...\n");
    mtr::RelayController relays;
    mtr::DacController dac;
    mtr::MotorManager mgr(relays, dac);
    mgr.init();

    send_mode(mgr, can::Mode::Manual, 100);
    send_power(mgr, true, 100);
    send_safety(mgr, false, 100);
    can::gen::RtDriveCmd drv{2000, static_cast<uint8_t>(can::Gear::D)};
    can::Frame drv_fr;
    can::gen::encode_rt_drive_cmd(drv, drv_fr);
    mgr.handle_frame(drv_fr, 100);
    mgr.tick(100);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);

    // Latch ESTOP via 0x001 + 0x011.
    can::Frame estop_fr;
    estop_fr.id = can::kIdSafetyEstop;
    estop_fr.dlc = 0;
    mgr.handle_frame(estop_fr, 105);
    send_safety(mgr, true, 108);
    ASSERT_TRUE(mgr.is_estop_active());

    // A SINGLE zero frame must NOT clear (asymmetric: baseline + advancing).
    send_safety_frames(mgr, false, 1, 110);
    ASSERT_TRUE(mgr.is_estop_active());
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);

    // Only the second consecutive zero frame completes the authorized clear.
    send_safety_frames(mgr, false, 1, 112);
    ASSERT_FALSE(mgr.is_estop_active());
}

// ═══════════════════════════════════════════════════════════════════════
// 7d. Motor Manager: loss of the 0x011 safety stream fails safe even while
//     drive/mode/power authorities remain fresh (independent freshness).
// ═══════════════════════════════════════════════════════════════════════
void test_motor_manager_safety_stream_freshness_fail_safe() {
    std::printf("[TEST GROUP] Motor Manager: 0x011 stream loss fails safe...\n");
    mtr::RelayController relays;
    mtr::DacController dac;
    mtr::MotorManager mgr(relays, dac);
    mgr.init();

    send_mode(mgr, can::Mode::Manual, 100);
    send_power(mgr, true, 100);
    send_safety(mgr, false, 100);
    can::gen::RtDriveCmd drv{2000, static_cast<uint8_t>(can::Gear::D)};
    can::Frame drv_fr;
    can::gen::encode_rt_drive_cmd(drv, drv_fr);
    mgr.handle_frame(drv_fr, 100);
    mgr.tick(100);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);

    // Keep drive, mode and power authorities fresh (within their windows) but
    // let only the 0x011 safety stream go silent past kSafetyFreshMs (700 ms).
    send_mode(mgr, can::Mode::Manual, 880);
    send_power(mgr, true, 880);
    mgr.handle_frame(drv_fr, 880);
    mgr.tick(900);  // 900 - 100 (last 0x011) = 800 > 700 -> safety stream stale
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_EQ(dac.current_code(), 0);
}

// ═══════════════════════════════════════════════════════════════════════
// 7e. Motor Manager: a corrupted (bad E2E CRC) 0x011 frame invalidates the
//     safety authority and fails safe even though drive is still fresh.
// ═══════════════════════════════════════════════════════════════════════
void test_motor_manager_safety_crc_corruption_fail_safe() {
    std::printf("[TEST GROUP] Motor Manager: 0x011 CRC corruption fails safe...\n");
    mtr::RelayController relays;
    mtr::DacController dac;
    mtr::MotorManager mgr(relays, dac);
    mgr.init();

    send_mode(mgr, can::Mode::Manual, 100);
    send_power(mgr, true, 100);
    send_safety(mgr, false, 100);
    can::gen::RtDriveCmd drv{2000, static_cast<uint8_t>(can::Gear::D)};
    can::Frame drv_fr;
    can::gen::encode_rt_drive_cmd(drv, drv_fr);
    mgr.handle_frame(drv_fr, 100);
    mgr.tick(100);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);

    // Corrupt 0x011 (bad CRC) — authority must be rejected. Keep mode/power/
    // drive fresh so the only failing authority is the safety stream.
    send_safety_corrupt(mgr, false, 880);
    send_mode(mgr, can::Mode::Manual, 880);
    send_power(mgr, true, 880);
    mgr.handle_frame(drv_fr, 880);
    mgr.tick(900);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_EQ(dac.current_code(), 0);
}

// ═══════════════════════════════════════════════════════════════════════
// 7f. Motor Manager: after an authorized clear, propulsion stays OFF until a
//     fresh REARM (0x113 OFF->ON) sequence is observed.
// ═══════════════════════════════════════════════════════════════════════
void test_motor_manager_recovery_requires_rearm() {
    std::printf("[TEST GROUP] Motor Manager: clear requires REARM gate...\n");
    mtr::RelayController relays;
    mtr::DacController dac;
    mtr::MotorManager mgr(relays, dac);
    mgr.init();

    send_mode(mgr, can::Mode::Manual, 100);
    send_power(mgr, true, 100);
    send_safety(mgr, false, 100);
    can::gen::RtDriveCmd drv{2000, static_cast<uint8_t>(can::Gear::D)};
    can::Frame drv_fr;
    can::gen::encode_rt_drive_cmd(drv, drv_fr);
    mgr.handle_frame(drv_fr, 100);
    mgr.tick(100);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);

