shakilapr/etrike/mtr-stm32/test/test_mtr_full_suite.cpp
    // Latch ESTOP.
    can::Frame estop_fr;
    estop_fr.id = can::kIdSafetyEstop;
    estop_fr.dlc = 0;
    mgr.handle_frame(estop_fr, 105);
    send_safety(mgr, true, 108);
    ASSERT_TRUE(mgr.is_estop_active());

    // Authorized clear via two zero 0x011 frames.
    send_safety(mgr, false, 110);
    ASSERT_FALSE(mgr.is_estop_active());

    // Cleared, but propulsion must remain OFF until REARM is observed.
    mgr.handle_frame(drv_fr, 115);
    mgr.tick(115);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_EQ(dac.current_code(), 0);

    // Fresh REARM: 0x110 mode + 0x113 OFF then ON edge.
    send_mode(mgr, can::Mode::Manual, 120);
    send_power(mgr, false, 120);
    send_power(mgr, true, 120);
    mgr.handle_frame(drv_fr, 120);
    mgr.tick(120);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);
}

// ═══════════════════════════════════════════════════════════════════════
// 8. FDCAN Driver: FIFO 0 Ringbuffer Mechanics
// ═══════════════════════════════════════════════════════════════════════

void test_fdcan_driver_ringbuffer() {
    std::printf("[TEST GROUP] FDCAN Driver: Ringbuffer & Filter Mechanics...\n");
    fdcan_mock::reset();

    mtr::CanDriver driver(hfdcan1);
    ASSERT_TRUE(driver.init());

    // Test FIFO push and poll
    can::Frame fr_out;
    ASSERT_FALSE(driver.poll_rx(fr_out)); // Empty ringbuffer

    // Inject 3 frames via ISR callback
    for (uint32_t id : {0x001u, 0x110u, 0x204u}) {
        fdcan_mock::MockMsg m{};
        m.id = id;
        m.ext = false;
        m.dlc = 8;
        m.data[0] = static_cast<uint8_t>(id & 0xFF);
        fdcan_mock::g_rx_queue.push_back(m);
    }

    driver.handle_rx_fifo0_isr();

    // Verify FIFO ordering: 0x001, 0x110, 0x204
    ASSERT_TRUE(driver.poll_rx(fr_out));
    ASSERT_EQ(fr_out.id, 0x001u);

    ASSERT_TRUE(driver.poll_rx(fr_out));
    ASSERT_EQ(fr_out.id, 0x110u);

    ASSERT_TRUE(driver.poll_rx(fr_out));
    ASSERT_EQ(fr_out.id, 0x204u);

    ASSERT_FALSE(driver.poll_rx(fr_out)); // Exhausted

    // Test Ringbuffer Overflow (size is 32)
    // Push 35 frames
    for (int i = 0; i < 35; ++i) {
        fdcan_mock::MockMsg m{};
        m.id = 0x204u;
        m.ext = false;
        m.dlc = 1;
        fdcan_mock::g_rx_queue.push_back(m);
    }
    driver.handle_rx_fifo0_isr();

    // Should detect overflow and count drops
    ASSERT_TRUE(driver.rx_overflow() > 0);

    // Test Transmit path
    can::Frame tx_frame(0x206, false, 4);
    tx_frame.data[0] = 0xAA;
    ASSERT_TRUE(driver.send(tx_frame));
    ASSERT_EQ(driver.tx_count(), 1u);
    ASSERT_EQ(fdcan_mock::g_tx_msgs.size(), 1u);
    ASSERT_EQ(fdcan_mock::g_tx_msgs[0].id, 0x206u);
}

// ═══════════════════════════════════════════════════════════════════════
// 7g. Motor Manager: SYS asserts the E-stop purely via 0x011 estop_active
//     (the SYS_SAFETY_STS authority) — NO 0x001 SAFETY_ESTOP needed. This is
//     the SYS->MTR cross-node estop propagation (item #8): when SYS decides to
//     halt, it reports estop_active = 1 on 0x011 and the motor MUST cut.
// ═══════════════════════════════════════════════════════════════════════
void test_motor_manager_sys_estop_via_safety_status() {
    std::printf("[TEST GROUP] Motor Manager: SYS 0x011 estop_active cuts motor (#8)...\n");
    mtr::RelayController relays;
    mtr::DacController dac;
    mtr::MotorManager mgr(relays, dac);
    mgr.init();

    // Normal driving in Drive with all authorities fresh (mode/power/0x011).
    send_mode(mgr, can::Mode::Manual, 100);
    send_power(mgr, true, 100);
    send_safety(mgr, false, 100);
    can::gen::RtDriveCmd drv{2000, static_cast<uint8_t>(can::Gear::D)};
    can::Frame drv_fr;
    can::gen::encode_rt_drive_cmd(drv, drv_fr);
    mgr.handle_frame(drv_fr, 100);
    mgr.tick(100);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);

    // SYS reports estop_active = 1 on 0x011 (no 0x001 SAFETY_ESTOP anywhere).
    send_safety(mgr, true, 108);
    ASSERT_TRUE(mgr.is_estop_active());
    mgr.tick(110);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off); // motor CUT
    ASSERT_EQ(dac.current_code(), 0);

    // Two consecutive fresh zero 0x011 frames -> authorized clear.
    send_safety(mgr, false, 120);
    ASSERT_FALSE(mgr.is_estop_active());

    // Landing stays OFF until a fresh REARM (0x113 OFF->ON) is observed.
    mgr.handle_frame(drv_fr, 125);
    mgr.tick(125);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_EQ(dac.current_code(), 0);

    // Fresh REARM -> motor resumes.
    send_mode(mgr, can::Mode::Manual, 130);
    send_power(mgr, false, 130);
    send_power(mgr, true, 130);
    mgr.handle_frame(drv_fr, 130);
    mgr.tick(130);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);
}

// ═══════════════════════════════════════════════════════════════════════
// Issue #2: dedicated 0x204 RT_DRIVE_CMD watchdog. The generic "any CAN frame
// within 500 ms" deadman must NOT be the only thing protecting propulsion:
// a frozen 0x204 while 0x110/0x113/0x011 stay alive must trip a fail-safe
// disable within the dedicated window, and it must recover only after N
// consecutive valid 0x204 frames at plausible cadence.
// ═══════════════════════════════════════════════════════════════════════
void test_motor_manager_drive_cmd_watchdog() {
    std::printf("[TEST GROUP] Motor Manager: dedicated 0x204 drive-command watchdog (#2)...\n");

    // ── A: drive in AUTO, then 0x204 goes stale while authority stays fresh ──
    {
        mtr::RelayController relays;
        mtr::DacController dac;
        mtr::MotorManager mgr(relays, dac);
        mgr.init();

        send_mode(mgr, can::Mode::Auto, 100);
        send_power(mgr, true, 100);
        send_safety(mgr, false, 100);
        can::gen::RtDriveCmd drv{2000, static_cast<uint8_t>(can::Gear::D)};
        can::Frame drv_fr;
        can::gen::encode_rt_drive_cmd(drv, drv_fr);
        mgr.handle_frame(drv_fr, 100);
        mgr.tick(100);
        ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
        ASSERT_TRUE(dac.current_code() > 0);
        ASSERT_TRUE(mgr.is_drive_expected());
        ASSERT_FALSE(mgr.is_drive_cmd_timed_out());

